{
    "basics": {
    "name": "Melanie MARIANI",
    "label": "Junior Programmer ",
    "image": "picture.png",
    "email": "melanieborja.pro@gmail.com",
    "phone": "07.84.18.85.72",
    "url": "https://www.mdm-development.fr/",
    "summary": ["Je suis actuellement étudiante chez OpenClassrooms en tant que développeur front-end spécialisé en JavaScript et React, avec un niveau Bac+3/4. J'ai travaillé en tant qu'assistante de direction pendant plus de 10 ans avant de découvrir ma passion pour le développement.","\n",  
    " Je suis à la recherche d'une alternance à partir de septembre 2023 afin de réaliser un cursus en Bac+5 UX Designer. Mon sérieux et ma conscience professionnelle sont des atouts que je mets en avant dans mon parcours.","\n", 
        " Je suis motivée et engagée à poursuivre mes objectifs et à acquérir de nouvelles compétences pour évoluer dans le domaine du design UX.","\n", 
        "J'ai hâte de découvrir de nouvelles perspectives et de relever de nouveaux défis dans mon parcours professionnel."],
    "location": {
      "address": "13 Villa  Vauthier",
      "postalCode": "94100",
      "city": "Saint-Maur-des-Fossés",
      "countryCode": "France"
        },
    "profiles": [
      {
        "network": "Linkedin",
        "username": "Mélanie MARIANI",
        "url": "www.linkedin.com/in/melanie-mariani"
      },
      {
        "network": "Github",
        "username": "melaniemdm",
        "url": "https://github.com/melaniemdm" 
      }
   
   ]
  },
  "work": [
    {
      "name": "Intelligence Canine ",
      "location": "Lésigny (77)",
      "description": "Développeur concepteur",
      "position": "Développeur concepteur",
      "url": "https://billetterie-attendance-tracker.netlify.app",
      "startDate": "2022",
      "endDate": "2022",
      "summary": [
        "Conception from scratch d'une application, en utilisant des technologies telles que HTML, CSS et JavaScript",
        "Utilisation de JavaScript pour implémenter des fonctionnalités avancées dans uneapplication",
        "Conception et développement d'une application pour la génération de billets avec des codes QR uniques, ainsi que pour la vérification des entrées sur smartphone. "    
      ],
      
      "highlights": [
        "Front-End React, Back-End Rest sous back4app, HTML, CSS et JavaScript,Figma, Netlify",
        "Respect du cdc client",
        "Respect du délais",
        "Compétence en développement web front-end, y compris la création de sites web vitrines, l'utilisation de technologies de pointe. ",
        "Compétence en gestion du cycle de vie complet des projets web, y compris la planification, la conception, le développement, la mise en production et la maintenance continue de l'application.",
        "Compétence en déploiement d'application' web",
        "Compétence en développement d'applications mobiles pour smartphones ",
        "Compétence en travail en autonomie et en collaboration avec le client"
      ]
    },
    {
      "name": "Intelligence Canine ",
      "location": "Lésigny (77)",
      "description": "Développeur concepteur",
      "position": "Développeur concepteur",
      "url": "https://intelligence-canine.fr/",
      "startDate": "2022",
      "endDate": "2022",
      "summary": [
        "Création from scratch du site vitrine, en utilisant des technologies telles que HTML, CSS et JavaScript",
        "Élaboration d'un wireframe et d'une maquette Figma pour planifier et conceptualiser ",
        "Déploiement du site vitrine sur une plateforme de hosting en ligne, notamment Netlify, et gestion des paramètres de configuration de l'environnement pour optimiser les performances du site.",
        "Utilisation de JavaScript pour implémenter des fonctionnalités avancées sur le site web, telles que l'interaction avec l'utilisateur et la manipulation dynamique du contenu.",
        "Conception et développement une application pour la génération de billets avec des codes QR uniques, ainsi que pour la vérification des entrées sur smartphone. "      
      ],
          "highlights": [
        "Front-End React, HTML, CSS, JavaScript, Netlify, Figma " ,
        "Respect du cdc client",
        "Respect du délais",
        "Compétence en développement web front-end, y compris la création de sites web vitrines, l'utilisation de technologies de pointe.",
        "Compétence en gestion du cycle de vie complet des projets web, y compris la planification, la conception, le développement, la mise en production et la maintenance continue des sites web.",
        "Compétence en déploiement de sites web",
        "Compétence en développement d'applications mobiles pour smartphones ",
        "Compétence en travail en autonomie et en collaboration avec le client"
      ]
    },
    {
      "name": "JSMarketing  ",
      "location": "",
      "description": "Développeur",
      "position": "Développeur",
      "url": "https://jsmarketingconsulting.com/",
      "startDate": "2021",
      "endDate": "2021",
      "summary": [
        "Adaptation,d'un thème Wordpress aux spécifités souhiatés par le client",
        "Création from scratch du site vitrine, en utilisant des technologies telles que HTML, CSS",
        "Élaboration d'un wireframe et d'une maquette Figma pour planifier et conceptualiser ",
        "Gestion des paramètres de configuration de l'environnement pour optimiser les performances du site.",
        "Utilisation de JavaScript pour implémenter des fonctionnalités avancées sur le site web, telles que l'interaction avec l'utilisateur et la manipulation dynamique du contenu."  
      ],
      "highlights": [
        "CSS, HTML, Wordpress ",
        "Respect du cdc client",
        "Respect du délais",
        "Utilisation avancé de Gutenberg(éditeur de bloc Wordpress)",
        "Compétence en déploiement de sites web",
        "Compétence en adaptation de thèmes pour les sites web, y compris la compréhension des besoins du client et la personnalisation du design et des fonctionnalités pour répondre à ses exigences spécifiques.",
        "Compétence en travail en autonomie et en collaboration avec le client"
      ]
    },
    {
      "name": "Association Saint-Maurienne-des-Amis-Des-Animaux ",
      "location": "Saint-Maur-Des-Fossés (94)",
      "description": "Développeur",
      "position": "Développeur",
      "url": "https://www.animaux-saint-maur.com/",
      "startDate": "2019",
      "endDate": "A ce jour",
      "summary": [
        "Adaptation de thèmes pour les sites web, en personnalisant le design et les fonctionnalités pour répondre aux exigences spécifiques des clients, par exemple en adaptant un thème Simplebo.",
        "Publication de contenu pour les sites web, en créant des articles pertinents et en mettant régulièrement à jour le contenu existant pour assurer la qualité et la pertinence du site.",
        "Modification de la structure du site",
        "Community Manager (publication, suivi des statistiques, reponses aux followers..)"
              ],
      "highlights": [
        "Simplebo " ,
        "Respect du cdc client",
        "Respect du délais",
        "Adaptation de thèmes pour les sites web, y compris la compréhension des besoins du client et la personnalisation du design et des fonctionnalités pour répondre à ses exigences spécifiques.",
        "Publication de contenu pour les sites web, y compris la création d'articles pertinents, la mise à jour du contenu existant et la gestion des bases de données de contenu pour assurer la qualité et la pertinence du site.",
        "Compétence en travail en autonomie et en collaboration avec le client",
        "Modification de la structure des sites web",
        "Collaboration avec les clients et les parties prenantes pour comprendre leurs besoins et leurs attentes, et en communication pour transmettre des informations claires et précises sur les actions entreprises et les résultats obtenus.",
        "Compétence en travail en autonomie pour planifier et réaliser les tâches assignées, en respectant les délais et les objectifs de qualité et de pertinence fixés."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "ASMAA",
      "position": "Website management",
      "url": "https://www.animaux-saint-maur.com/",
      "startDate": "2019",
      "endDate": "2022 ",
      "summary": "addition of animals to adopt and update of the site",
      "highlights": [
        "combine profession and passion"
      ]
    }
  ],
  "education": [
    {
      "institution": "OpenClassRooms - Developpeur Front-end Java-Script React",
      "url": "https://openclassrooms.com/fr/",
      "area": "",
      "studyType": "",
      "startDate": "2020",
      "endDate": "2023",
      "score": "",
      "courses": [
        "Analyser les besoins à partir du cahier des charges défini par le client ou le chef de projet" ,
        "Implémenter des mockups avec du code de qualité ",
        "Optimiser le temps de chargement des pages",
        "Communiquer avec les développeurs back-end pour assurer l’échange d’information dans l’application",
        "Utiliser les bonnes pratiques pour structurer le code HTML, CSS et Javascript ",
        "Utiliser des frameworks comme React pour construire des applications puissantes et modulaires" ,
        "Tester le bon fonctionnement de l’application et corriger le code quand c’est nécessaire" ,
        "Assurer le support technique du site et produire une documentation technique et fonctionnelle du site pour le client"
      ]
    },
    {
      "institution": "AFT IFTIM - Formation Tutorat",
      "url": "",
      "area": "",
      "studyType": "",
      "startDate": "2012",
      "endDate": "2012",
      "score": "",
      "courses": [
       "Tutrice pendant 3 ans",
       "Transmition du savoir faire"
      ]
    },
    {
      "institution": "IMCP - BTS ASSISTANTE DE GESTION PME -PMI en alternance",
      "url": "",
      "area": "",
      "studyType": "",
      "startDate": "2006",
      "endDate": "2008",
      "score": "niveau",
      "courses": [
        "Organisation d’évènements",
        "Veille",
        "Préparation de dossiers",
        "Gestion des ressources humaines"
      ]
    }
  ],
  
  "skills": [
    {
      "name": "Web Development",
      "level": "Medium",
      "keywords": [
        "HTML",
        "CSS",
        "Javascript",
        "SASS",
        "React", 
        "Next"
      ]
    },
    {
      "name": "Content management system (CMS)",
      "level": "Medium",
      "keywords": [
        "Simplébo",
        "Wordpress"
      ]
    },
    {
      "name": "Framework CSS",
      "level": "Medium",
      "keywords": [
        "TailwindCss",
        "Boostrap"
      ]
    },
        {
      "name": "Assistante IA",
      "level": "Medium",
      "keywords": [
        "ChatGPT",
        "Codeium",
        "Github copilot",
        "Midjourney"
        
      ]
    },
    {
      "name": "Divers",
      "level": "Medium",
      "keywords": [
        "Jest",
        "Figma",
        "Recharts",
        "Redux"
      ]
    }
  ],
  "languages": [
    {
      "language": "French",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Notion"
    }
  ],
  "interests": [
    {
      "name": "Music",
      "keywords": [
        "Radio"
           ]
    },
    {
      "name": "Japanese culture",
      "keywords": [
        "Slime",
        "Naruto",
        "Hunter x hunter...."
      ]
    },
    {
      "name": "Animal protection association",
      "keywords": [
        "Website management",
        "Social media posts"       
      ]
    }
  ],
  "references": [
    {
      "name": "Jalna Soulage",
      "reference": "Mélanie a été une aide précieuse dans le development de mon site web. Elle a su résoudre plusieurs de mes problèmes techniques rapidement. Forte de proposition, nous avons ensemble modifié certains éléments et j’en suis ravie. Professionnelle, disponible et très agréable, je recommande Mélanie pour avancer rapidement sur votre projet de site web ! "
    },
    {
      "name": "Intelligence Canine",
      "reference": "Personne très professionnelle compétente et très réactive.Sa collaboration fut fortement appréciée, un régal de pouvoir faire confiance !"
    },
    {
      "name": "Sylviane Stevenard",
      "reference": "Merci à MDM development d'avoir fait un super travail ! Rapidité, efficacité, communication, compréhension !Bref un développeur au Top !"
    }
  ]
}